In [1]:
import numpy as np
import pandas as pd

In [2]:
# creating dataset by 3 methods
# 1. by dictonary
# 2. by ndarray
# 3. by scalar value
# syntax : pd.Series(data, index)

In [3]:
# by dictonary
dict = {'A': 5 , 'B' : 6 , 'C' : 7}
dataset = pd.Series(dict)

In [4]:
dataset

A    5
B    6
C    7
dtype: int64

In [5]:
# if dictionary is provided to series then dictionary key is dataframe index and dictionary value is dataframe value
# if dictionary is provided to dataframe then key becomes attribute name
people = {
    'First' : ['A', 'R', 'J'],
    'Last' : ["C", 'R','C'],
    'No' : [123,456,890]
}

In [6]:
dataset = pd.Series(people)

In [7]:
dataset

First          [A, R, J]
Last           [C, R, C]
No       [123, 456, 890]
dtype: object

In [8]:
dataset = pd.DataFrame(people)

In [9]:
dataset

  First Last   No
0     A    C  123
1     R    R  456
2     J    C  890

In [10]:
type(dataset)

pandas.core.frame.DataFrame

In [11]:
type(dataset['First'])
# Series is rows of data
# if dataset is concern then series is rows of single column

pandas.core.series.Series

In [12]:
# 2ways to print a series

In [13]:
dataset['First']

0    A
1    R
2    J
Name: First, dtype: object

In [14]:
dataset.First

0    A
1    R
2    J
Name: First, dtype: object

In [15]:
dataset[['Last','First']]

  Last First
0    C     A
1    R     R
2    C     J

In [16]:
dataset.columns

Index(['First', 'Last', 'No'], dtype='object')

In [17]:
# to get row we have loc and iloc 
# iloc allows to allow us to locate integer
# loc

dataset.iloc[0:2]
# or 
# dataset.iloc[[0,1]]

  First Last   No
0     A    C  123
1     R    R  456

In [18]:
# to print any specific column of specific row then mention that way
# dataset.iloc[[rows],column_no]
# second column is printed in that we have choosen first two rows only
# in iloc we exlude last element in slicing. only include first element
# in loc we include both first and last element while slicing
# iloc is only about index as integer and loc is name of column
dataset.iloc[[0,1],2]

0    123
1    456
Name: No, dtype: int64

In [19]:
# in our dataset index is number so we access it by that number
dataset.loc[1]

First      R
Last       R
No       456
Name: 1, dtype: object

In [20]:
dataset.loc[[1,2]]

  First Last   No
1     R    R  456
2     J    C  890

In [21]:
# we can also print column by calling it by name
dataset.loc[[0,1],['No','First']]

    No First
0  123     A
1  456     R

In [22]:
data = pd.read_csv('card_transdata.csv')

In [23]:
data.shape

(1000000, 8)

In [24]:
data.columns

Index(['distance_from_home', 'distance_from_last_transaction',
       'ratio_to_median_purchase_price', 'repeat_retailer', 'used_chip',
       'used_pin_number', 'online_order', 'fraud'],
      dtype='object')

In [25]:
data.iloc[2:10]

,distance_from_home,distance_from_last_transaction,ratio_to_median_purchase_price,repeat_retailer,used_chip,used_pin_number,online_order,fraud
2,5.091079,0.805153,0.427715,1.0,0.0,0.0,1.0,0.0
3,2.247564,5.600044,0.362663,1.0,1.0,0.0,1.0,0.0
4,44.190936,0.566486,2.222767,1.0,1.0,0.0,1.0,0.0
5,5.586408,13.261073,0.064768,1.0,0.0,0.0,0.0,0.0
6,3.724019,0.956838,0.278465,1.0,0.0,0.0,1.0,0.0
7,4.848247,0.320735,1.273050,1.0,0.0,1.0,0.0,0.0
8,0.876632,2.503609,1.516999,0.0,0.0,0.0,0.0,0.0
9,8.839047,2.970512,2.361683,1.0,0.0,0.0,1.0,0.0

In [26]:
data.iloc[2:10,1:4]

,distance_from_last_transaction,ratio_to_median_purchase_price,repeat_retailer
2,0.805153,0.427715,1.0
3,5.600044,0.362663,1.0
4,0.566486,2.222767,1.0
5,13.261073,0.064768,1.0
6,0.956838,0.278465,1.0
7,0.320735,1.273050,1.0
8,2.503609,1.516999,0.0
9,2.970512,2.361683,1.0

In [27]:
data.loc[[10,11,12,13,14],'distance_from_last_transaction']

10     0.158758
11     0.240540
12     0.371562
13    56.372401
14     0.271522
Name: distance_from_last_transaction, dtype: float64

In [28]:
data.loc[12:24,['distance_from_last_transaction','repeat_retailer']]

    distance_from_last_transaction  repeat_retailer
12                        0.371562              1.0
13                       56.372401              1.0
14                        0.271522              1.0
15                        0.120920              1.0
16                        0.707003              1.0
17                        6.247458              1.0
18                       34.661351              1.0
19                        1.142014              1.0
20                        1.409245              1.0
21                        4.822091              1.0
22                        0.069201              0.0
23                        0.138203              1.0
24                       67.241081              1.0

In [29]:
data['fraud'].value_counts()

0.0    912597
1.0     87403
Name: fraud, dtype: int64

# index

In [30]:
data.set_index('distance_from_last_transaction', inplace = True) 
# if we write inplace = True then these changes will be permanent

In [31]:
data.index

Float64Index([0.3111400080477545, 0.1755915022816658, 0.8051525945853258,
                5.60004354707232, 0.5664862680583477,  13.26107326805812,
              0.9568379284821842, 0.3207354272228163,  2.503608926692144,
              2.9705122760243827,
              ...
              11.437332545461755, 0.1025737864627129, 0.2501075967658249,
               2.844450192169913, 0.0857117956722119, 0.1126513027947371,
              2.6839037264517254, 1.4726866870566833, 0.2420233659455144,
              0.3181101207150046],
             dtype='float64', name='distance_from_last_transaction', length=1000000)

In [32]:
data

,distance_from_home,ratio_to_median_purchase_price,repeat_retailer,used_chip,used_pin_number,online_order,fraud
distance_from_last_transaction,,,,,,,
0.311140,57.877857,1.945940,1.0,1.0,0.0,0.0,0.0
0.175592,10.829943,1.294219,1.0,0.0,0.0,0.0,0.0
0.805153,5.091079,0.427715,1.0,0.0,0.0,1.0,0.0
5.600044,2.247564,0.362663,1.0,1.0,0.0,1.0,0.0
0.566486,44.190936,2.222767,1.0,1.0,0.0,1.0,0.0
...,...,...,...,...,...,...,...
0.112651,2.207101,1.626798,1.0,1.0,0.0,0.0,0.0
2.683904,19.872726,2.778303,1.0,1.0,0.0,0.0,0.0
1.472687,2.914857,0.218075,1.0,1.0,0.0,1.0,0.0
0.242023,4.258729,0.475822,1.0,0.0,0.0,1.0,0.0
0.318110,58.108125,0.386920,1.0,1.0,0.0,1.0,0.0

In [33]:
data.loc[0.3111400080477545]

distance_from_home                57.877857
ratio_to_median_purchase_price     1.945940
repeat_retailer                    1.000000
used_chip                          1.000000
used_pin_number                    0.000000
online_order                       0.000000
fraud                              0.000000
Name: 0.3111400080477545, dtype: float64

In [34]:
data.reset_index(inplace = True)
data

,distance_from_last_transaction,distance_from_home,ratio_to_median_purchase_price,repeat_retailer,used_chip,used_pin_number,online_order,fraud
0,0.311140,57.877857,1.945940,1.0,1.0,0.0,0.0,0.0
1,0.175592,10.829943,1.294219,1.0,0.0,0.0,0.0,0.0
2,0.805153,5.091079,0.427715,1.0,0.0,0.0,1.0,0.0
3,5.600044,2.247564,0.362663,1.0,1.0,0.0,1.0,0.0
4,0.566486,44.190936,2.222767,1.0,1.0,0.0,1.0,0.0
...,...,...,...,...,...,...,...,...
999995,0.112651,2.207101,1.626798,1.0,1.0,0.0,0.0,0.0
999996,2.683904,19.872726,2.778303,1.0,1.0,0.0,0.0,0.0
999997,1.472687,2.914857,0.218075,1.0,1.0,0.0,1.0,0.0
999998,0.242023,4.258729,0.475822,1.0,0.0,0.0,1.0,0.0
999999,0.318110,58.108125,0.386920,1.0,1.0,0.0,1.0,0.0

# Filtering

In [35]:
dict = {
    'First' : ['A','J','R','S']     ,
    'Last' :  ['C','C','R','C'] ,
    'email' : ['ac@gmail.com','jc@gmail.com','rr@gmail.com','st@gmail.com']
}

In [36]:
df = pd.DataFrame(dict)

In [37]:
df

  First Last         email
0     A    C  ac@gmail.com
1     J    C  jc@gmail.com
2     R    R  rr@gmail.com
3     S    C  st@gmail.com

In [38]:
df['Last'] == 'C'

0     True
1     True
2    False
3     True
Name: Last, dtype: bool

In [39]:
filt = (df['Last'] == 'C')

In [40]:
df[filt]
# another method is df[df['Last'] == 'Chaudhari']

  First Last         email
0     A    C  ac@gmail.com
1     J    C  jc@gmail.com
3     S    C  st@gmail.com

In [41]:
df.loc[filt]

  First Last         email
0     A    C  ac@gmail.com
1     J    C  jc@gmail.com
3     S    C  st@gmail.com

In [42]:
df.loc[filt, 'Last']

0    C
1    C
3    C
Name: Last, dtype: object

In [43]:
filt = (df['Last'] == 'C') | (df['First'] == 'J')

In [44]:
df[filt]
# we can use df[~filt] for negation result

  First Last         email
0     A    C  ac@gmail.com
1     J    C  jc@gmail.com
3     S    C  st@gmail.com

In [45]:
data

,distance_from_last_transaction,distance_from_home,ratio_to_median_purchase_price,repeat_retailer,used_chip,used_pin_number,online_order,fraud
0,0.311140,57.877857,1.945940,1.0,1.0,0.0,0.0,0.0
1,0.175592,10.829943,1.294219,1.0,0.0,0.0,0.0,0.0
2,0.805153,5.091079,0.427715,1.0,0.0,0.0,1.0,0.0
3,5.600044,2.247564,0.362663,1.0,1.0,0.0,1.0,0.0
4,0.566486,44.190936,2.222767,1.0,1.0,0.0,1.0,0.0
...,...,...,...,...,...,...,...,...
999995,0.112651,2.207101,1.626798,1.0,1.0,0.0,0.0,0.0
999996,2.683904,19.872726,2.778303,1.0,1.0,0.0,0.0,0.0
999997,1.472687,2.914857,0.218075,1.0,1.0,0.0,1.0,0.0
999998,0.242023,4.258729,0.475822,1.0,0.0,0.0,1.0,0.0
999999,0.318110,58.108125,0.386920,1.0,1.0,0.0,1.0,0.0

In [46]:
df

  First Last         email
0     A    C  ac@gmail.com
1     J    C  jc@gmail.com
2     R    R  rr@gmail.com
3     S    C  st@gmail.com

In [47]:
name_list = ['A','R']
filt = (df['First'].isin(name_list))

In [48]:
df[filt]

  First Last         email
0     A    C  ac@gmail.com
2     R    R  rr@gmail.com

# update rows and columns

In [49]:
df.columns

Index(['First', 'Last', 'email'], dtype='object')

In [50]:
# rename column names
df.columns = ['first_name','last_name','mobile']

In [51]:
df.columns

Index(['first_name', 'last_name', 'mobile'], dtype='object')

In [52]:
df

  first_name last_name        mobile
0          A         C  ac@gmail.com
1          J         C  jc@gmail.com
2          R         R  rr@gmail.com
3          S         C  st@gmail.com

In [53]:
# make all column names in upper case letter
df.columns = [x.upper() for x in df.columns]
df

  FIRST_NAME LAST_NAME        MOBILE
0          A         C  ac@gmail.com
1          J         C  jc@gmail.com
2          R         R  rr@gmail.com
3          S         C  st@gmail.com

In [54]:
# replace _ by space in column name
df.columns = df.columns.str.replace('_',' ')
df

  FIRST NAME LAST NAME        MOBILE
0          A         C  ac@gmail.com
1          J         C  jc@gmail.com
2          R         R  rr@gmail.com
3          S         C  st@gmail.com

In [55]:
df.columns = [x.lower() for x in df.columns]
df

  first name last name        mobile
0          A         C  ac@gmail.com
1          J         C  jc@gmail.com
2          R         R  rr@gmail.com
3          S         C  st@gmail.com

In [56]:
df.rename(columns = {"mobile" : "e mail"}, inplace = True)
df

  first name last name        e mail
0          A         C  ac@gmail.com
1          J         C  jc@gmail.com
2          R         R  rr@gmail.com
3          S         C  st@gmail.com

In [57]:
df.columns = [df.columns.str.replace(' ','_')]
df

  first_name last_name        e_mail
0          A         C  ac@gmail.com
1          J         C  jc@gmail.com
2          R         R  rr@gmail.com
3          S         C  st@gmail.com

In [58]:
df.rename(columns = {'first_name' : 'fname', 'last_name' : 'lname'}, inplace = True)
df

  fname lname        e_mail
0     A     C  ac@gmail.com
1     J     C  jc@gmail.com
2     R     R  rr@gmail.com
3     S     C  st@gmail.com

In [59]:
# now replace some value in the dataset
# either .loc[row][column]
# or pass a list to .loc[row]
df.loc[2]['fname'] = 'Anderson'
df

      fname lname        e_mail
0         A     C  ac@gmail.com
1         J     C  jc@gmail.com
2  Anderson     R  rr@gmail.com
3         S     C  st@gmail.com

In [60]:
#df.loc[2] = ['R','R','rr@gmail.com']
#df
# another method
df.loc[5,['fname','lname']] = ['G','B']
df
# to change one value we can write
#df.at[2, 'fname'] = 'somethig'

      fname lname        e_mail
0         A     C  ac@gmail.com
1         J     C  jc@gmail.com
2  Anderson     R  rr@gmail.com
3         S     C  st@gmail.com
5         G     B           NaN

In [61]:
no = df['fname'] == 'Anderson'

In [62]:
df.loc[2,'e_mail'] = 'ar@gmail.com'
df.loc[5,'e_mail'] = 'gb@gmail.com'
df

      fname lname        e_mail
0         A     C  ac@gmail.com
1         J     C  jc@gmail.com
2  Anderson     R  ar@gmail.com
3         S     C  st@gmail.com
5         G     B  gb@gmail.com

In [63]:
# apply
df['lname'].apply(len)

lname    5
dtype: int64

In [64]:
def to_upper(lname) :
    return lname.upper()

In [65]:
# df['lname'] = df['lname'].apply(to_upper)
# also write lambda function

In [66]:
df

      fname lname        e_mail
0         A     C  ac@gmail.com
1         J     C  jc@gmail.com
2  Anderson     R  ar@gmail.com
3         S     C  st@gmail.com
5         G     B  gb@gmail.com

In [67]:
df.apply(len) # axis = columns

fname     5
lname     5
e_mail    5
dtype: int64

In [68]:
df

      fname lname        e_mail
0         A     C  ac@gmail.com
1         J     C  jc@gmail.com
2  Anderson     R  ar@gmail.com
3         S     C  st@gmail.com
5         G     B  gb@gmail.com

In [69]:
# df.applymap(len)

In [70]:
# df.applymap(str.lower)
# if dataframe have numerical data then error is there and also for NaN values

In [71]:
# to replace column name to another
df.rename(columns = {'e_mail' : 'email'} ,inplace = True)

In [72]:
df

      fname lname         email
0         A     C  ac@gmail.com
1         J     C  jc@gmail.com
2  Anderson     R  ar@gmail.com
3         S     C  st@gmail.com
5         G     B  gb@gmail.com

In [73]:
data

,distance_from_last_transaction,distance_from_home,ratio_to_median_purchase_price,repeat_retailer,used_chip,used_pin_number,online_order,fraud
0,0.311140,57.877857,1.945940,1.0,1.0,0.0,0.0,0.0
1,0.175592,10.829943,1.294219,1.0,0.0,0.0,0.0,0.0
2,0.805153,5.091079,0.427715,1.0,0.0,0.0,1.0,0.0
3,5.600044,2.247564,0.362663,1.0,1.0,0.0,1.0,0.0
4,0.566486,44.190936,2.222767,1.0,1.0,0.0,1.0,0.0
...,...,...,...,...,...,...,...,...
999995,0.112651,2.207101,1.626798,1.0,1.0,0.0,0.0,0.0
999996,2.683904,19.872726,2.778303,1.0,1.0,0.0,0.0,0.0
999997,1.472687,2.914857,0.218075,1.0,1.0,0.0,1.0,0.0
999998,0.242023,4.258729,0.475822,1.0,0.0,0.0,1.0,0.0
999999,0.318110,58.108125,0.386920,1.0,1.0,0.0,1.0,0.0

In [74]:
data['used_chip'] = data['used_chip'].map({1.0 : 'Yes', 0.0 : 'No'}) 
# map() doesnt have inplace argument it by default set it as permanant

In [75]:
data

,distance_from_last_transaction,distance_from_home,ratio_to_median_purchase_price,repeat_retailer,used_chip,used_pin_number,online_order,fraud
0,0.311140,57.877857,1.945940,1.0,Yes,0.0,0.0,0.0
1,0.175592,10.829943,1.294219,1.0,No,0.0,0.0,0.0
2,0.805153,5.091079,0.427715,1.0,No,0.0,1.0,0.0
3,5.600044,2.247564,0.362663,1.0,Yes,0.0,1.0,0.0
4,0.566486,44.190936,2.222767,1.0,Yes,0.0,1.0,0.0
...,...,...,...,...,...,...,...,...
999995,0.112651,2.207101,1.626798,1.0,Yes,0.0,0.0,0.0
999996,2.683904,19.872726,2.778303,1.0,Yes,0.0,0.0,0.0
999997,1.472687,2.914857,0.218075,1.0,Yes,0.0,1.0,0.0
999998,0.242023,4.258729,0.475822,1.0,No,0.0,1.0,0.0
999999,0.318110,58.108125,0.386920,1.0,Yes,0.0,1.0,0.0

In [76]:
# data['repeat_retailer'].count_values()

In [77]:
pd.set_option('display.max_rows', None)

In [78]:
filt = data['used_chip'] == 'Yes'

In [79]:
df

      fname lname         email
0         A     C  ac@gmail.com
1         J     C  jc@gmail.com
2  Anderson     R  ar@gmail.com
3         S     C  st@gmail.com
5         G     B  gb@gmail.com

# add/remove row and column

In [80]:
# add column
df['full_Name'] = df[['fname', 'lname']].apply(lambda x: '_'.join(x), axis=1)
# df['full_name_'] = df['fname'] + ' ' + df['lname']

In [81]:
df

      fname lname         email   full_Name
0         A     C  ac@gmail.com         A_C
1         J     C  jc@gmail.com         J_C
2  Anderson     R  ar@gmail.com  Anderson_R
3         S     C  st@gmail.com         S_C
5         G     B  gb@gmail.com         G_B

In [82]:
df.columns = ['fname','lname','email','full name']
df

      fname lname         email   full name
0         A     C  ac@gmail.com         A_C
1         J     C  jc@gmail.com         J_C
2  Anderson     R  ar@gmail.com  Anderson_R
3         S     C  st@gmail.com         S_C
5         G     B  gb@gmail.com         G_B

In [83]:
# remove column
df.drop(columns = ['fname','lname'], inplace = True)

In [84]:
# add column from existing data
df['full name'].str.split(' ',expand = True)

            0
0         A_C
1         J_C
2  Anderson_R
3         S_C
5         G_B

In [86]:
df

          email   full name
0  ac@gmail.com         A_C
1  jc@gmail.com         J_C
2  ar@gmail.com  Anderson_R
3  st@gmail.com         S_C
5  gb@gmail.com         G_B

In [87]:
# adding a single row of data
df.append({'first' : 'Steve','last' : 'Harvy', 'email' : 'sh@gmail.com'}, ignore_index = True) # if ignore_index = True not written then erroris given

          email   full name  first   last
0  ac@gmail.com         A_C    NaN    NaN
1  jc@gmail.com         J_C    NaN    NaN
2  ar@gmail.com  Anderson_R    NaN    NaN
3  st@gmail.com         S_C    NaN    NaN
4  gb@gmail.com         G_B    NaN    NaN
5  sh@gmail.com         NaN  Steve  Harvy

In [88]:
# add dataframe into another dataframe
dict1 = {
    'first' : ['William','agent']     ,
    'last' :  ['Stanley','jack'] ,
    'email' : ['ws@gmail.com','aj@gmail.com']
}

In [89]:
df1 = pd.DataFrame(dict1)

In [90]:
df1

     first     last         email
0  William  Stanley  ws@gmail.com
1    agent     jack  aj@gmail.com

In [91]:
df1['full name'] = df1['first'] + ' ' + df1['last']

In [92]:
df1

     first     last         email        full name
0  William  Stanley  ws@gmail.com  William Stanley
1    agent     jack  aj@gmail.com       agent jack

In [93]:
df = df.append(df1,ignore_index = True)

In [94]:
df

          email        full name    first     last
0  ac@gmail.com              A_C      NaN      NaN
1  jc@gmail.com              J_C      NaN      NaN
2  ar@gmail.com       Anderson_R      NaN      NaN
3  st@gmail.com              S_C      NaN      NaN
4  gb@gmail.com              G_B      NaN      NaN
5  ws@gmail.com  William Stanley  William  Stanley
6  aj@gmail.com       agent jack    agent     jack

In [95]:
df.drop(index = 5, inplace = True)

In [96]:
df

          email   full name  first  last
0  ac@gmail.com         A_C    NaN   NaN
1  jc@gmail.com         J_C    NaN   NaN
2  ar@gmail.com  Anderson_R    NaN   NaN
3  st@gmail.com         S_C    NaN   NaN
4  gb@gmail.com         G_B    NaN   NaN
6  aj@gmail.com  agent jack  agent  jack

In [97]:
# drop row with specific condition then use filter
filt = (df['first'] !=  'agent')

In [98]:
df[filt]

          email   full name first last
0  ac@gmail.com         A_C   NaN  NaN
1  jc@gmail.com         J_C   NaN  NaN
2  ar@gmail.com  Anderson_R   NaN  NaN
3  st@gmail.com         S_C   NaN  NaN
4  gb@gmail.com         G_B   NaN  NaN

In [99]:
# another method is 
df = df[df['first'] != 'agent']

In [100]:
df

          email   full name first last
0  ac@gmail.com         A_C   NaN  NaN
1  jc@gmail.com         J_C   NaN  NaN
2  ar@gmail.com  Anderson_R   NaN  NaN
3  st@gmail.com         S_C   NaN  NaN
4  gb@gmail.com         G_B   NaN  NaN

In [103]:
dataset.shape

(3, 3)

In [104]:
# by ndarray
# syntax : pd.Series(data, index)
from random import randint as rdn
dataset = pd.Series(np.random.randn(3), index = ['a','b','c'])
dataset

a   -0.626499
b    1.410780
c   -0.717161
dtype: float64

In [105]:
# if data is less then NaN is display at index name otherwise only index is printed
dictonary = {"b": 1, "a": 0, "c": 2}
dataset = pd.Series(dictonary, index = ['a','b','c','d'])
dataset

a    0.0
b    1.0
c    2.0
d    NaN
dtype: float64

In [106]:
# by a scalar value
dataset = pd.Series(5.0, index = ['a','b','c','d'])
dataset

a    5.0
b    5.0
c    5.0
d    5.0
dtype: float64